yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/qspi_reg.h
     * |        |          |Note: This bit will be cleared by writing 1 to it.
     * |[6]     |SLVBEIF   |Slave Mode Bit Count Error Interrupt Flag
     * |        |          |In Slave mode, when the slave select line goes to inactive state, if bit counter is mismatch with DWIDTH, this interrupt flag will be set to 1.
     * |        |          |0 = No Slave mode bit count error event.
     * |        |          |1 = Slave mode bit count error event occurred.
     * |        |          |Note: If the slave select active but there is no any bus clock input, the SLVBEIF also active when the slave select goes to inactive state
     * |        |          |This bit will be cleared by writing 1 to it.
     * |[7]     |SLVURIF   |Slave Mode TX Under Run Interrupt Flag
     * |        |          |In Slave mode, if TX underflow event occurs and the slave select line goes to inactive state, this interrupt flag will be set to 1.
     * |        |          |0 = No Slave TX under run event.
     * |        |          |1 = Slave TX under run event occurred.
     * |        |          |Note: This bit will be cleared by writing 1 to it.
     * |[8]     |RXEMPTY   |Receive FIFO Buffer Empty Indicator (Read Only)
     * |        |          |0 = Receive FIFO buffer is not empty.
     * |        |          |1 = Receive FIFO buffer is empty.
     * |[9]     |RXFULL    |Receive FIFO Buffer Full Indicator (Read Only)
     * |        |          |0 = Receive FIFO buffer is not full.
     * |        |          |1 = Receive FIFO buffer is full.
     * |[10]    |RXTHIF    |Receive FIFO Threshold Interrupt Flag (Read Only)
     * |        |          |0 = The valid data count within the receive FIFO buffer is smaller than or equal to the setting value of RXTH.
     * |        |          |1 = The valid data count within the receive FIFO buffer is larger than the setting value of RXTH.
     * |[11]    |RXOVIF    |Receive FIFO Overrun Interrupt Flag
     * |        |          |When the receive FIFO buffer is full, the follow-up data will be dropped and this bit will be set to 1.
     * |        |          |0 = No FIFO is overrun.
     * |        |          |1 = Receive FIFO is overrun.
     * |        |          |Note 1: This bit will be cleared by writing 1 to it.
     * |        |          |Note 2: If the RXONLY is enabled, the SPI bus length for one transaction shall greater than 5 ECLK + 2 PCLK, otherwise this flag will be set
     * |        |          |(ex
     * |        |          |8-bit length quad mode, thers is 2 bit bus cycle only and it is less than the limitation above).
     * |[12]    |RXTOIF    |Receive Time-out Interrupt Flag
     * |        |          |0 = No receive FIFO time-out event.
     * |        |          |1 = Receive FIFO buffer is not empty and no read operation on receive FIFO buffer over 64 QSPI peripheral clock periods in Master mode or over 576 QSPI peripheral clock periods in Slave mode
     * |        |          |When the received FIFO buffer is read by software, the time-out status will be cleared automatically.
     * |        |          |Note: This bit will be cleared by writing 1 to it.
     * |[15]    |SPIENSTS  |QSPI Enable Status (Read Only)
     * |        |          |0 = QSPI controller Disabled.
     * |        |          |1 = QSPI controller Enabled.
     * |        |          |Note: The QSPI peripheral clock is asynchronous with the system clock
     * |        |          |In order to make sure the QSPI control logic is disabled, this bit indicates the real status of QSPI controller.
     * |[16]    |TXEMPTY   |Transmit FIFO Buffer Empty Indicator (Read Only)
     * |        |          |0 = Transmit FIFO buffer is not empty.
     * |        |          |1 = Transmit FIFO buffer is empty.
     * |[17]    |TXFULL    |Transmit FIFO Buffer Full Indicator (Read Only)
     * |        |          |0 = Transmit FIFO buffer is not full.
     * |        |          |1 = Transmit FIFO buffer is full.
     * |[18]    |TXTHIF    |Transmit FIFO Threshold Interrupt Flag (Read Only)
     * |        |          |0 = The valid data count within the transmit FIFO buffer is larger than the setting value of TXTH.
     * |        |          |1 = The valid data count within the transmit FIFO buffer is less than or equal to the setting value of TXTH.
     * |[19]    |TXUFIF    |TX Underflow Interrupt Flag
     * |        |          |When the TX underflow event occurs, this bit will be set to 1, the state of data output pin depends on the setting of TXUFPOL.
     * |        |          |0 = No effect.
     * |        |          |1 = No data in Transmit FIFO and TX shift register when the slave selection signal is active.
     * |        |          |Note 1: This bit will be cleared by writing 1 to it.
     * |        |          |Note 2: If reset slaveu2019s transmission circuit when slave selection signal is active, this flag will be set to 1 after 2 peripheral clock cycles + 3 system clock cycles since the reset operation is done.
     * |[23]    |TXRXRST   |TX or RX Reset Status (Read Only)
     * |        |          |0 = The reset function of TXRST or RXRST is done.
     * |        |          |1 = Doing the reset function of TXRST or RXRST.
     * |        |          |Note: Both the reset operations of TXRST and RXRST need 3 system clock cycles + 2 peripheral clock cycles
     * |        |          |User can check the status of this bit to monitor the reset function is doing or done.
     * |[27:24] |RXCNT     |Receive FIFO Data Count (Read Only)
     * |        |          |This bit field indicates the valid data count of receive FIFO buffer.
     * |[31:28] |TXCNT     |Transmit FIFO Data Count (Read Only)
     * |        |          |This bit field indicates the valid data count of transmit FIFO buffer.
     * @var QSPI_T::STATUS2
     * Offset: 0x18  QSPI Status2 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[29:24] |SLVBENUM  |Effective Bit Number of Uncompleted RX data
     * |        |          |This status register indicates that effective bit number of uncompleted RX data when SLVBERX (QSPIx_FIFOCTL[10]) is enabled and RX bit count error event happen in QSPI slave mode.
     * |        |          |This status register will be fixed to 0x0 when SLVBERX (QSPIx_FIFOCTL[10]) is disabled.
     * |        |          |Note: Slave mode Only and this register will be cleared to 0x0 when user write 0x1 to SLVBEIF (QSPIx_STATUS[6]).
     * @var QSPI_T::TX
     * Offset: 0x20  QSPI Data Transmit Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |TX        |Data Transmit Register
     * |        |          |The data transmit registers pass through the transmitted data into the 8-level transmit FIFO buffers
     * |        |          |The number of valid bits depends on the setting of DWIDTH (QSPIx_CTL[12:8]) in QSPI mode.
     * |        |          |In QSPI mode, if DWIDTH is set to 0x08, the bits TX[7:0] will be transmitted
     * |        |          |If DWIDTH is set to 0x00, the QSPI controller will perform a 32-bit transfer.
     * |        |          |Note: In Master mode, QSPI controller will start to transfer the QSPI bus clock after 1 APB clock and 6 peripheral clock cycles after user writes to this register.
     * @var QSPI_T::RX
     * Offset: 0x30  QSPI Data Receive Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |RX        |Data Receive Register (Read Only)
     * |        |          |There are 8-level FIFO buffers in this controller
     * |        |          |The data receive register holds the data received from QSPI data input pin
     * |        |          |If the RXEMPTY (QSPIx_STATUS[8) is not set to 1, the receive FIFO buffers can be accessed through software by reading this register.
     * @var QSPI_T::INTERNAL
     * Offset: 0x48  QSPI Internal Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3]     |DLATCH    |Data Latch Mode
     * |        |          |It is used to adjust the input data source in data received direction
     * |        |          |If the output clock delay by PAD and the system loading is less than half cycle of QSPI_CLK in Master mode, the internal data shall be latched by the negative edge of QSPI module clock to fix the data is available
     * |        |          |On the contrary, if the output clock delay is over than half cycle of QSPI_CLK in Master mode, the internal data shall be latched by the positive edge of QSPI module clock
     * |        |          |This bit is used to enable /disable the data latched cycle which is tuned by hardware circuit
     * |        |          |If the output clock delay is less than half cycle of QSPI_CLK, there is active high signal in QSPI internal hardware
     * |        |          |If the active high signal is fail, the user can set the DATMODE as 1 to force the latched data in the right cycle.
     * |[7]     |SELFTEST  |Self-test Enable Bit
     * |        |          |0 = The self-test function Disabled.
     * |        |          |1 = Enable the self-test function. The Master received data will be the same as the transmit datum.
     * |[8]     |DEGOFF    |QSPI Bus Clock Deglitch Circuit Disable Bit
     * |        |          |0 = The QSPI bus clock Input deglitch circuit
     * |        |          |It can filter 1~2ns glitch on the QSPI bus clock when bus Enabled.
     * |        |          |1 = The QSPI bus clock Input deglitch circuit Disabled.
     * |[11]    |MRXCLKS   |SPI Master Receiver Clock Source
     * |        |          |It is used to select the clock source of receive data sampled into RX skew buffer while QSPI Master mode due to the system noise in serial clock bus.
     * |        |          |0 = Sample RX data by the Master feedback QSPI_CLK (Chip PAD-out loopback to PAD-in).
     * |        |          |1 = Sample RX data latter the 0.0 period of sending QSPI_CLK.
     * |        |          |Note: It is use in MRXPHASE = 4u2019h0 only.
     * |[15:12] |MRXPHASE  |QSPI Master Receive Phase Selection
     * |        |          |It is used to adjust the timing of receive data sampled into RX skew buffer while QSPI Master mode due to the PAD I/O latency (send QSPI_CLK to Slave device through the output pin and then wait the receive data from Slave device through the input pin)
     * |        |          |0x0: Sample RX data by the Master feedback QSPI_CLK (Chip PAD-out loopback to PAD-in)
     * |        |          |0x1: Sample RX data latter the 0.5 period of sending QSPI_CLK
     * |        |          |0x2: Sample RX data latter the 1 period of sending QSPI_CLK
     * |        |          |0x3: Sample RX data latter the 1.5 period of sending QSPI_CLK
     * |        |          |0x4: Sample RX data latter the 2 periods of sending QSPI_CLK
     * |        |          |u2026
     * |        |          |0xb: Sample RX data latter the 5.5 periods of sending QSPI_CLK.
     * |        |          |Others are reserved.
     * |        |          |Note: MRXPHASE equals to 0x1 when TX DTR mode enable and SPI master mode enable.
     * |[19:16] |RXRP      |RX FIFO Read Pointer
     * |        |          |Note: It is internal and Read only.
     * |[23:20] |RXWP      |RX FIFO Write Pointer
     * |        |          |Note: It is internal and Read only.
     * |[27:24] |TXRP      |TX FIFO Read Pointer
     * |        |          |Note: It is internal and Read only.
     * |[31:28] |TXWP      |TX FIFO Write Pointer
     * |        |          |Note: It is internal and Read only.
     * @var QSPI_T::VERSION
     * Offset: 0xFFC  QSPI Version Number Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |MINOR     |Minor Version Number
     * |        |          |Minor version number is dependent on ECO version control
     * |        |          |0x0000: (current Minor Version Number)
     * |[23:16] |SUB       |Sub Version Number
     * |        |          |Sub version number is relative to key feature
     * |        |          |0x02: (current Sub Version Number)
     * |[31:24] |MAJOR     |Major Version Number
     * |        |          |Major version number is correlated to Product Line
     * |        |          |0x02: (current Major Version Number)
     */
    __IO uint32_t CTL;                   /*!< [0x0000] QSPI Control Register                                            */
    __IO uint32_t CLKDIV;                /*!< [0x0004] QSPI Clock Divider Register                                      */
    __IO uint32_t SSCTL;                 /*!< [0x0008] QSPI Slave Select Control Register                               */
    __IO uint32_t PDMACTL;               /*!< [0x000c] QSPI PDMA Control Register                                       */
    __IO uint32_t FIFOCTL;               /*!< [0x0010] QSPI FIFO Control Register                                       */
    __IO uint32_t STATUS;                /*!< [0x0014] QSPI Status Register                                             */
    __I  uint32_t STATUS2;               /*!< [0x0018] QSPI Status2 Register                                            */
    __I  uint32_t RESERVE0[1];
    __O  uint32_t TX;                    /*!< [0x0020] QSPI Data Transmit Register                                      */
    __I  uint32_t RESERVE1[3];
    __I  uint32_t RX;                    /*!< [0x0030] QSPI Data Receive Register                                       */
    __I  uint32_t RESERVE2[5];
    __IO uint32_t INTERNAL;              /*!< [0x0048] QSPI Internal Control Register                                   */
    __I  uint32_t RESERVE3[1004];
    __I  uint32_t VERSION;               /*!< [0x0ffc] QSPI Version Number Register                                     */

} QSPI_T;

/**
    @addtogroup QSPI_CONST QSPI Bit Field Definition
    Constant Definitions for QSPI Controller
@{ */

#define QSPI_CTL_SPIEN_Pos               (0)                                               /*!< QSPI_T::CTL: SPIEN Position            */
#define QSPI_CTL_SPIEN_Msk               (0x1ul << QSPI_CTL_SPIEN_Pos)                     /*!< QSPI_T::CTL: SPIEN Mask                */

#define QSPI_CTL_RXNEG_Pos               (1)                                               /*!< QSPI_T::CTL: RXNEG Position            */
#define QSPI_CTL_RXNEG_Msk               (0x1ul << QSPI_CTL_RXNEG_Pos)                     /*!< QSPI_T::CTL: RXNEG Mask                */

