yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/qspi_reg.h
#define QSPI_INTERNAL_TXRP_Pos           (24)                                              /*!< QSPI_T::INTERNAL: TXRP Position        */
#define QSPI_INTERNAL_TXRP_Msk           (0xful << QSPI_INTERNAL_TXRP_Pos)                 /*!< QSPI_T::INTERNAL: TXRP Mask            */

#define QSPI_INTERNAL_TXWP_Pos           (28)                                              /*!< QSPI_T::INTERNAL: TXWP Position        */
#define QSPI_INTERNAL_TXWP_Msk           (0xful << QSPI_INTERNAL_TXWP_Pos)                 /*!< QSPI_T::INTERNAL: TXWP Mask            */

#define QSPI_VERSION_MINOR_Pos           (0)                                               /*!< QSPI_T::VERSION: MINOR Position        */
#define QSPI_VERSION_MINOR_Msk           (0xfffful << QSPI_VERSION_MINOR_Pos)              /*!< QSPI_T::VERSION: MINOR Mask            */

#define QSPI_VERSION_SUB_Pos             (16)                                              /*!< QSPI_T::VERSION: SUB Position          */
#define QSPI_VERSION_SUB_Msk             (0xfful << QSPI_VERSION_SUB_Pos)                  /*!< QSPI_T::VERSION: SUB Mask              */

#define QSPI_VERSION_MAJOR_Pos           (24)                                              /*!< QSPI_T::VERSION: MAJOR Position        */
#define QSPI_VERSION_MAJOR_Msk           (0xfful << QSPI_VERSION_MAJOR_Pos)                /*!< QSPI_T::VERSION: MAJOR Mask            */

/**@}*/ /* QSPI_CONST */
/**@}*/ /* end of QSPI register group */

/**@}*/ /* end of REGISTER group */

#if defined ( __CC_ARM   )
#pragma no_anon_unions
#endif

#endif /* __QSPI_REG_H__ */